# **3: Querying Customers**

## Import Libraries

In [29]:
from sqlalchemy import create_engine
import pandas as pd

## Connect to Database

In [30]:
engine = create_engine('postgresql://bryguan:qwertyuiop@localhost:5432/acme')
connection = engine.connect().execution_options(auto_commit = True)

## Queries

### Customers

In [31]:
query = '''

SELECT
    COUNT(*) as customers
FROM 
    customers_1;

'''

try:
    with connection.begin():
        display(pd.read_sql_query(query, connection))
except Exception as e:
    print(f' Error {e}')

   customers
0      31082

### Non-Purchasing Customers

In [32]:
query = '''

SELECT
    COUNT(*) as non_purchasing_customers
FROM 
    customers_1
WHERE
    customer_id NOT IN (SELECT DISTINCT customer_id FROM sales_1)

'''

try:
    with connection.begin():
        display(pd.read_sql_query(query, connection))
except Exception as e:
    print(f' Error {e}')

   non_purchasing_customers
0                        35

### Customers by Store

In [33]:
query = '''

SELECT
    stores_1.city as store,
    COUNT(customers_1.customer_id) as customers
FROM 
    stores_1
JOIN 
    customers_1 ON stores_1.store_id = customers_1.store_id
GROUP BY
    store
ORDER BY
    store ASC;

'''

try:
    with connection.begin():
        display(pd.read_sql_query(query, connection))
except Exception as e:
    print(f' Error {e}')

       store  customers
0   Berkeley       8138
1     Dallas       6359
2      Miami       5725
3  Nashville       3646
4    Seattle       7214

### Customers by City

In [34]:
query = '''

SELECT
    city,
    count(customer_id) as customers
FROM 
    customers_1
GROUP BY
    city
ORDER BY
    customers DESC;
    
'''

try:
    with connection.begin():
        display(pd.read_sql_query(query, connection))
except Exception as e:
    print(f' Error {e}')

            city  customers
0         Dallas       4754
1        Seattle       4300
2          Miami       4205
3      Nashville       2582
4        Oakland       1928
..           ...        ...
193   San Carlos          1
194  San Anselmo          1
195     Pacifica          1
196  Lake Dallas          1
197   Cottontown          1

[198 rows x 2 columns]

### Customers by Sales

In [35]:
query = '''

SELECT
    customers_1.customer_id,
    customers_1.first_name,
    customers_1.last_name,
    count(sales_1.sale_id) as sales
FROM 
    customers_1
JOIN
    sales_1 ON customers_1.customer_id = sales_1.customer_id
GROUP BY
    customers_1.customer_id
ORDER BY
    sales DESC;
    
'''

try:
    with connection.begin():
        display(pd.read_sql_query(query, connection))
except Exception as e:
    print(f' Error {e}')

       customer_id first_name   last_name  sales
0          28918.0      Liuka      Oseman    123
1          27728.0        Gus  Haliburton    122
2          27674.0     Anjela   Millichap    120
3          27762.0    Jenelle     Goretti    119
4          28253.0    Shellie       Percy    119
...            ...        ...         ...    ...
31042      15264.0     Jordan    Foulgham     12
31043       6174.0       Nick    Cartmell     12
31044       9828.0  Josephina      Leguey     12
31045      13465.0     Trisha     Hawgood     11
31046       6485.0      Alyce  Wainwright      9

[31047 rows x 4 columns]

### Customers by Quantity

In [36]:
query = '''

SELECT
    customers_1.customer_id,
    customers_1.first_name,
    customers_1.last_name,
    SUM(quantity) as quantity
FROM 
    customers_1
JOIN
    sales_1 ON customers_1.customer_id = sales_1.customer_id
JOIN 
    line_items_1 ON sales_1.store_id = line_items_1.store_id AND sales_1.sale_id = line_items_1.sale_id
GROUP BY
    customers_1.customer_id
ORDER BY
    quantity DESC;
    
'''

try:
    with connection.begin():
        display(pd.read_sql_query(query, connection))
except Exception as e:
    print(f' Error {e}')

       customer_id first_name    last_name  quantity
0          30772.0   Marthena  Hrinchishin     694.0
1          30775.0      Howey     Di Dello     659.0
2          30692.0   Benjamen          Eva     655.0
3          30323.0     Wilbur       Garvie     654.0
4          28543.0  Marmaduke  Sherebrooke     654.0
...            ...        ...          ...       ...
31042      15264.0     Jordan     Foulgham      59.0
31043       1528.0      Lorin       Cherry      57.0
31044      12861.0      Kacie     Leeburne      56.0
31045      22530.0  Thomasina         Maus      54.0
31046       6485.0      Alyce   Wainwright      51.0

[31047 rows x 4 columns]

## Close Connection

In [37]:
connection.close()
engine.dispose()